AcRxMember.subChildrenEx(AcArray&lt;AcRxMember!System.Runtime.CompilerServices.IsConst**,AcArrayMemCopyReallocator&lt;AcRxMember!System.Runtime.CompilerServices.IsConst**&gt;&gt;**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
The function returns the children of the member.
The difference between subChildren and subChildrenEx is in memory management.
Derived classes that override this function are responsible for managing the pChildren
array - allocationg and deleting. the base class will not hold on to the array and will not call it
The default implementation calls subChildren first. If that method returns Acad::eNotApplicable,
the subChildrenEx is called.
children:
Output reference to an AcArray object, that contains the children.
Returns:  Returns Acad::eOk if successful; otherwise, returns an AutoCAD error status.

AcRxMember.subChildren(AcArray&lt;AcRxMember!System.Runtime.CompilerServices.IsConst**,AcArrayMemCopyReallocator&lt;AcRxMember!System.Runtime.CompilerServices.IsConst**&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
The function returns the children of the member.
The difference between subChildren and subChildrenEx is in memory management.
Derived class can override function to provide custom implementation. The changes to the children array
are cached after the initial call and the derived class will not have a chance to modify the array
on subsequent calls to children()
The default implementation calls subChildren first. If that method returns Acad::eNotApplicable,
then subChildrenEx is called.
children:
Input reference to an AcArray object, to receive the children.
Returns:  Returns Acad::eOk if successful; otherwise, returns an AutoCAD error status.

AcRxMember.subLocalName
The function returns the localized name of the member, if any.
Derived class can override function to provide custom implementation.
Returns:
Returns AcString object that contains the name

AcRxMember.new(System.UInt64,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.Int32)
debug new operator

AcRxMember.new(System.UInt64)
new operator

AcRxMember.deleteMember(AcRxMember!System.Runtime.CompilerServices.IsConst*)
deletes the member passed in and sends "goodbye" notification via AcRxMemberReactor.

AcRxMember.children
Returns the children of this member.
Returns:
Returns pointer to an AcArray object if it has children

AcRxMember.owner
Returns the owner of this member.
Returns:
Returns pointer to an AcRxObject if it has an owner, otherwise it returns NULL

AcRxMember.attributes
Returns the immutable collection of attributes for this member.
Returns:
Returns const reference to an AcRxAttributeCollection object
Returns the collection of attributes for this member.
Returns:
Returns reference to an AcRxAttributeCollection object

AcRxMember.type
Returns the type of the member.
Returns:
Returns const reference to an AcRxValueType object

AcRxMember.localName
Returns the localized name of the member, if any.
Returns:
Returns AcString object that contains the name

AcRxMember.name
Returns the name of the member
Returns:
Returns const ACHAR* that points to the name

AcRxMember
Base class for all members. Encapsulates common member properties and
behavior.